<?php
$_lang['msocial_error_posting'] = 'Произошла ошибка при постинге в';

$_lang['area_msocial_main'] = 'Основные';

$_lang['setting_msocial_im_ps'] = 'Прикреплять изображения.';
$_lang['setting_msocial_im_ps_desc'] = 'Если выбрано Да то из тела сообщения будут выбираться изображения и прикрепляться к посту. <b>ВАЖНО</b>: документы будут сохранятся значительно дольше. Если выбрано Нет, изображения прикрепляться не будут.';

// Twitter
$_lang['setting_msocial_tw_ck'] = 'Consumer Key (API Key).';
$_lang['setting_msocial_tw_cs'] = 'Consumer Secret (API Secret).';
$_lang['setting_msocial_tt_ot'] = 'Access Token.';
$_lang['setting_msocial_tw_os'] = 'Access Token Secret.';
$_lang['setting_msocial_tw_tp']  = 'Чанк шаблона для Twitter.';

//Vk
$_lang['setting_msocial_vk_tp'] = 'Чанк шаблона для Vk.';
$_lang['setting_msocial_vk_id'] = 'Id юзера.';
$_lang['setting_msocial_vk_id_desc'] = 'Поддерживает постинг как на страницу юзера, так и в группу. Идентификатор для соцсети vk.com на страницу которого будем добавлять сообщения. <b>ВАЖНО</b> если вы хотите добавлять в группу то указывайте идентификатор с приставленным минусом. Т.е. если id вашей группы 32432432432 вставляем -32432432432.';
$_lang['setting_msocial_vk_at'] = 'Ключ доступа (access_token).';
$_lang['setting_msocial_vk_at_desc'] = 'Ключ доступа (access_token), подтверждающий ваши права на управление аккаунтом, где и как его получить можно посмотреть в документации к расширению.';
$_lang['setting_msocial_im_fg'] = 'От имени группы.';
$_lang['setting_msocial_im_fg_desc'] = 'Изменяет возможность постинга от имени группы и от имени пользователя. <b>ВАЖНО</b> работает только при размещении постов в группы. Если выбрано <b>нет</b>, постим от имени юзера. Если выбрано  <b>да</b> постим от имени группы.';

//Fb
$_lang['setting_msocial_fb_tp'] = 'Чанк шаблона для Fb.';
$_lang['setting_msocial_fb_id'] = 'Id юзера.';
$_lang['setting_msocial_fb_id_desc'] = 'Поддерживает постинг как на страницу юзера, так и в группу. Идентификатор для соцсети facebook.com на страницу которого будем добавлять сообщения.';
$_lang['setting_msocial_fb_at'] = 'Ключ доступа (access_token).';
$_lang['setting_msocial_fb_at_desc'] = 'Ключ доступа (access_token), подтверждающий ваши права на управление аккаунтом, где и как его получить можно посмотреть в документации к расширению.';
$_lang['setting_msocial_fb_lk'] = 'Вставлять ссылку.';
$_lang['setting_msocial_fb_lk_desc'] = 'Api facebook не позволяет прикреплять к посту список изображений. Однако он позволяет размещать блок с ссылкой и изображением данный пункт включает размещение ссылки.';
$_lang['setting_msocial_fb_fg'] = 'От имени группы.';
$_lang['setting_msocial_fb_fg_desc'] = 'Изменяет возможность постинга от имени группы и от имени пользователя. <b>ВАЖНО</b> работает только при размещении постов в группы. Если выбрано <b>нет</b>, постим от имени юзера. Если выбрано  <b>да</b> постим от имени группы.';
